Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_clock.c
/****************************************************************************
 *
 * Copyright 2019 NXP Semiconductors All Rights Reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
 * either express or implied. See the License for the specific
 * language governing permissions and limitations under the License.
 *
 ****************************************************************************/

#include "imxrt_clock.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* To make full use of CM7 hardware FPU, use double instead of uint64_t in clock driver to
achieve better performance, it is depend on the IDE Floating point settings, if double precision is selected
in IDE, clock_64b_t will switch to double type automatically. only support IAR and MDK here */
#ifdef ARCH_HAVE_FPU

#if ((defined(__ICCARM__)) || (defined(__GNUC__)))

#if (__ARMVFP__ >= __ARMFPV5__) && \
	(__ARM_FP == 0xE) /*0xe implies support for half, single and double precision operations*/
typedef double clock_64b_t;
#else
typedef uint64_t clock_64b_t;
#endif

#elif defined(__CC_ARM) || defined(__ARMCC_VERSION)

#if defined(__TARGET_FPU_FPV5_D16)
typedef double clock_64b_t;
#else
typedef uint64_t clock_64b_t;
#endif

#else
typedef uint64_t clock_64b_t;
#endif

#else
typedef uint64_t clock_64b_t;
#endif

/*******************************************************************************
 * Variables
 ******************************************************************************/

/* External XTAL (OSC) clock frequency. */
volatile uint32_t g_xtalFreq;
/* External RTC XTAL clock frequency. */
volatile uint32_t g_rtcXtalFreq;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*!
 * @brief Get the periph clock frequency.
 *
 * @return Periph clock frequency in Hz.
 */
static uint32_t imxrt_clock_getperiphclkfreq(void);

/*******************************************************************************
 * Code
 ******************************************************************************/
/****************************************************************************
 * Function: imxrt_clock_getperiphclkfreq
 *
 * Description:
 *   Get the peripheral clock frequency
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Returns the resulting frequency
 *
 ****************************************************************************/
static uint32_t imxrt_clock_getperiphclkfreq(void)
{
	uint32_t freq;

	/* Periph_clk2_clk ---> Periph_clk */
	if (CCM->CBCDR & CCM_CBCDR_PERIPH_CLK_SEL_MASK) {
		switch (CCM->CBCMR & CCM_CBCMR_PERIPH_CLK2_SEL_MASK) {
		/* Pll3_sw_clk ---> Periph_clk2_clk ---> Periph_clk */
		case CCM_CBCMR_PERIPH_CLK2_SEL(0U):
			freq = imxrt_clock_getpllfreq(kCLOCK_PllUsb1);
			break;
		/* Osc_clk ---> Periph_clk2_clk ---> Periph_clk */
		case CCM_CBCMR_PERIPH_CLK2_SEL(1U):
			freq = imxrt_clock_getoscfreq();
			break;
		case CCM_CBCMR_PERIPH_CLK2_SEL(2U):
			freq = imxrt_clock_getpllfreq(kCLOCK_PllSys);
			break;
		case CCM_CBCMR_PERIPH_CLK2_SEL(3U):
		default:
			freq = 0U;
			break;
		}

		freq /= (((CCM->CBCDR & CCM_CBCDR_PERIPH_CLK2_PODF_MASK) >> CCM_CBCDR_PERIPH_CLK2_PODF_SHIFT) + 1U);
	} else { /* Pre_Periph_clk ---> Periph_clk */
		switch (CCM->CBCMR & CCM_CBCMR_PRE_PERIPH_CLK_SEL_MASK) {
		/* PLL2 ---> Pre_Periph_clk ---> Periph_clk */
		case CCM_CBCMR_PRE_PERIPH_CLK_SEL(0U):
			freq = imxrt_clock_getpllfreq(kCLOCK_PllSys);
			break;
		/* PLL2 PFD2 ---> Pre_Periph_clk ---> Periph_clk */
		case CCM_CBCMR_PRE_PERIPH_CLK_SEL(1U):
			freq = imxrt_clock_getsyspfdfreq(kCLOCK_Pfd2);
			break;
		/* PLL2 PFD0 ---> Pre_Periph_clk ---> Periph_clk */
		case CCM_CBCMR_PRE_PERIPH_CLK_SEL(2U):
			freq = imxrt_clock_getsyspfdfreq(kCLOCK_Pfd0);
			break;
		/* PLL1 divided(/2) ---> Pre_Periph_clk ---> Periph_clk */
		case CCM_CBCMR_PRE_PERIPH_CLK_SEL(3U):
			#if defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
			freq = 500000000U;
			#elif defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT105x)
			freq = imxrt_clock_getpllfreq(kCLOCK_PllArm) /
					(((CCM->CACRR & CCM_CACRR_ARM_PODF_MASK) >> CCM_CACRR_ARM_PODF_SHIFT) + 1U);
			#endif
			break;
		default:
			freq = 0U;
			break;
		}
	}

	return freq;
}

/****************************************************************************
 * Function: imxrt_clock_initexternalclk
 *
 * Description:
 *   brief Initialize the external 24MHz clock.
 *
 *   This function supports two modes:
 *     1. Use external crystal oscillator.
 *     2. Bypass the external crystal oscillator, using input source clock directly.
 *
 *   After this function, please call ref CLOCK_SetXtal0Freq to inform clock driver
 *   the external clock frequency.
 *
 * Input Parameters:
 *   bypassXtalOsc Pass in true to bypass the external crystal oscillator.
 *   note This device does not support bypass external crystal oscillator, so
 *   the input parameter should always be false.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_initexternalclk(bool bypassXtalOsc)
{
	/* This device does not support bypass XTAL OSC. */
	DEBUGASSERT(!bypassXtalOsc);

	CCM_ANALOG->MISC0_CLR = CCM_ANALOG_MISC0_XTAL_24M_PWD_MASK; /* Power up */
	while ((XTALOSC24M->LOWPWR_CTRL & XTALOSC24M_LOWPWR_CTRL_XTALOSC_PWRUP_STAT_MASK) == 0) {
	}
	CCM_ANALOG->MISC0_SET = CCM_ANALOG_MISC0_OSC_XTALOK_EN_MASK; /* detect freq */
	while ((CCM_ANALOG->MISC0 & CCM_ANALOG_MISC0_OSC_XTALOK_MASK) == 0) {
	}
	CCM_ANALOG->MISC0_CLR = CCM_ANALOG_MISC0_OSC_XTALOK_EN_MASK;
}

/****************************************************************************
 * Function: imxrt_clock_deinitexternalclk
 *
 * Description:
 *   brief Deinitialize the external 24MHz clock.
 *
 *   This function disables the external 24MHz clock.
 *
 *   After this function, please call ref CLOCK_SetXtal0Freq to set external clock
 *   frequency to 0.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_deinitexternalclk(void)
{
	CCM_ANALOG->MISC0_SET = CCM_ANALOG_MISC0_XTAL_24M_PWD_MASK; /* Power down */
}

/****************************************************************************
 * Function: imxrt_clock_getperiphclkfreq
 *
 * Description:
 *   brief Switch the OSC.
 *
 *   This function switches the OSC source for SoC.
 *
 * Input Parameters:
 *   param osc   OSC source to switch to.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_switchosc(clock_osc_t osc)
{
	if (osc == kCLOCK_RcOsc)
		XTALOSC24M->LOWPWR_CTRL_SET = XTALOSC24M_LOWPWR_CTRL_SET_OSC_SEL_MASK;
	else
		XTALOSC24M->LOWPWR_CTRL_CLR = XTALOSC24M_LOWPWR_CTRL_CLR_OSC_SEL_MASK;
}

/****************************************************************************
 * Function: imxrt_clock_initrcosc24m
 *
 * Description:
 *   brief Initialize the RC oscillator 24MHz clock.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_initrcosc24m(void)
{
	XTALOSC24M->LOWPWR_CTRL |= XTALOSC24M_LOWPWR_CTRL_RC_OSC_EN_MASK;
}

/****************************************************************************
 * Function: imxrt_clock_deinitrcosc24m
 *
 * Description:
 *   brief Power down the RCOSC 24M clock.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_deinitrcosc24m(void)
{
	XTALOSC24M->LOWPWR_CTRL &= ~XTALOSC24M_LOWPWR_CTRL_RC_OSC_EN_MASK;
}

/****************************************************************************
 * Function: imxrt_clock_getahbfreq
 *
 * Description:
 *   brief Gets the AHB clock frequency.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Returns The AHB clock frequency value in hertz.
 *
 ****************************************************************************/
uint32_t imxrt_clock_getahbfreq(void)
{
	return imxrt_clock_getperiphclkfreq() / (((CCM->CBCDR & CCM_CBCDR_AHB_PODF_MASK) >> CCM_CBCDR_AHB_PODF_SHIFT) + 1U);
}

/****************************************************************************
 * Function: imxrt_clock_getsemcfreq
 *
 * Description:
 *   brief Gets the SEMC clock frequency.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Returns The SEMC clock frequency value in hertz.
 *
 ****************************************************************************/
uint32_t imxrt_clock_getsemcfreq(void)
{
	uint32_t freq;

	/* SEMC alternative clock ---> SEMC Clock */
	if (CCM->CBCDR & CCM_CBCDR_SEMC_CLK_SEL_MASK) {
		/* PLL3 PFD1 ---> SEMC alternative clock ---> SEMC Clock */
		if (CCM->CBCDR & CCM_CBCDR_SEMC_ALT_CLK_SEL_MASK) {
			freq = imxrt_clock_getusb1pfdfreq(kCLOCK_Pfd1);
		} else { /* PLL2 PFD2 ---> SEMC alternative clock ---> SEMC Clock */
			freq = imxrt_clock_getsyspfdfreq(kCLOCK_Pfd2);
		}
	} else { /* Periph_clk ---> SEMC Clock */
		freq = imxrt_clock_getperiphclkfreq();
	}

