Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_clock.c
	freq /= (((CCM->CBCDR & CCM_CBCDR_SEMC_PODF_MASK) >> CCM_CBCDR_SEMC_PODF_SHIFT) + 1U);

	return freq;
}

/****************************************************************************
 * Function: imxrt_clock_getipgfreq
 *
 * Description:
 *   brief Gets the IPG clock frequency.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Returns The IPG clock frequency value in hertz.
 *
 ****************************************************************************/
uint32_t imxrt_clock_getipgfreq(void)
{
	return imxrt_clock_getahbfreq() / (((CCM->CBCDR & CCM_CBCDR_IPG_PODF_MASK) >> CCM_CBCDR_IPG_PODF_SHIFT) + 1U);
}

/****************************************************************************
 * Function: imxrt_clock_getperclkfreq
 *
 * Description:
 *   brief Gets the PER clock frequency.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Returns The PER clock frequency value in hertz.
 *
 ****************************************************************************/
uint32_t imxrt_clock_getperclkfreq(void)
{
	uint32_t freq;

	/* Osc_clk ---> PER Clock*/
	if (CCM->CSCMR1 & CCM_CSCMR1_PERCLK_CLK_SEL_MASK) {
		freq = imxrt_clock_getoscfreq();
	} else { /* Periph_clk ---> AHB Clock ---> IPG Clock ---> PER Clock */
		freq = imxrt_clock_getfreq(kCLOCK_IpgClk);
	}

	freq /= (((CCM->CSCMR1 & CCM_CSCMR1_PERCLK_PODF_MASK) >> CCM_CSCMR1_PERCLK_PODF_SHIFT) + 1U);

	return freq;
}

/****************************************************************************
 * Function: imxrt_clock_getfreq
 *
 * Description:
 *   brief Gets the clock frequency for a specific clock name.
 * 
 *   This function checks the current clock configurations and then calculates
 *   the clock frequency for a specific clock name defined in clock_name_t.
 *
 * Input Parameters:
 *   clockName Clock names defined in clock_name_t
 *
 * Returned Value:
 *   Returns Clock frequency value in hertz
 *
 ****************************************************************************/
uint32_t imxrt_clock_getfreq(clock_name_t name)
{
	uint32_t freq;

	switch (name) {
	case kCLOCK_CpuClk:
	case kCLOCK_AhbClk:
		freq = imxrt_clock_getahbfreq();
		break;
	case kCLOCK_SemcClk:
		freq = imxrt_clock_getsemcfreq();
		break;
	case kCLOCK_IpgClk:
		freq = imxrt_clock_getipgfreq();
		break;
	case kCLOCK_PerClk:
		freq = imxrt_clock_getperclkfreq();
		break;
	case kCLOCK_OscClk:
		freq = imxrt_clock_getoscfreq();
		break;
	case kCLOCK_RtcClk:
		freq = imxrt_clock_getrtcfreq();
		break;
	#if !defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
	case kCLOCK_ArmPllClk:
		freq = imxrt_clock_getpllfreq(kCLOCK_PllArm);
		break;
	#endif
	case kCLOCK_Usb1PllClk:
		freq = imxrt_clock_getpllfreq(kCLOCK_PllUsb1);
		break;
	case kCLOCK_Usb1PllPfd0Clk:
		freq = imxrt_clock_getusb1pfdfreq(kCLOCK_Pfd0);
		break;
	case kCLOCK_Usb1PllPfd1Clk:
		freq = imxrt_clock_getusb1pfdfreq(kCLOCK_Pfd1);
		break;
	case kCLOCK_Usb1PllPfd2Clk:
		freq = imxrt_clock_getusb1pfdfreq(kCLOCK_Pfd2);
		break;
	case kCLOCK_Usb1PllPfd3Clk:
		freq = imxrt_clock_getusb1pfdfreq(kCLOCK_Pfd3);
		break;
	#if !defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
	case kCLOCK_Usb2PllClk:
		freq = imxrt_clock_getpllfreq(kCLOCK_PllUsb2);
		break;
	#endif
	case kCLOCK_SysPllClk:
		freq = imxrt_clock_getpllfreq(kCLOCK_PllSys);
		break;
	case kCLOCK_SysPllPfd0Clk:
		freq = imxrt_clock_getsyspfdfreq(kCLOCK_Pfd0);
		break;
	case kCLOCK_SysPllPfd1Clk:
		freq = imxrt_clock_getsyspfdfreq(kCLOCK_Pfd1);
		break;
	case kCLOCK_SysPllPfd2Clk:
		freq = imxrt_clock_getsyspfdfreq(kCLOCK_Pfd2);
		break;
	case kCLOCK_SysPllPfd3Clk:
		freq = imxrt_clock_getsyspfdfreq(kCLOCK_Pfd3);
		break;
	#if defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
	case kCLOCK_EnetPllClk:
		freq = imxrt_clock_getpllfreq(kCLOCK_PllEnet);
		break;
	case kCLOCK_EnetPll25MClk:
		freq = imxrt_clock_getpllfreq(kCLOCK_PllEnet25M);
		break;
	case kCLOCK_EnetPll500MClk:
		freq = imxrt_clock_getpllfreq(kCLOCK_PllEnet500M);
		break;
	#elif defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT105x)
	case kCLOCK_EnetPll0Clk:
		freq = imxrt_clock_getpllfreq(kCLOCK_PllEnet);
		break;
	case kCLOCK_EnetPll1Clk:
		freq = imxrt_clock_getpllfreq(kCLOCK_PllEnet25M);
		break;
	#endif
	case kCLOCK_AudioPllClk:
		freq = imxrt_clock_getpllfreq(kCLOCK_PllAudio);
		break;
	#if !defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
	case kCLOCK_VideoPllClk:
		freq = imxrt_clock_getpllfreq(kCLOCK_PllVideo);
		break;
	#endif
	default:
		freq = 0U;
		break;
	}

	return freq;
}

/****************************************************************************
 * Function: imxrt_clock_enableusbhs0clock
 *
 * Description:
 *   brief Enable USB HS clock.
 * 
 *   This function only enables the access to USB HS prepheral, upper layer
 *   should first call the ref CLOCK_EnableUsbhs0PhyPllClock to enable the PHY
 *   clock to use USB HS.
 *
 * Input Parameters:
 *   src  USB HS does not care about the clock source, here must be ref kCLOCK_UsbSrcUnused.
 *   freq USB HS does not care about the clock source, so this parameter is ignored.
 *
 * Returned Value:
 *   Returns true The clock is set successfully.
 *   Returns false The clock source is invalid to get proper USB HS clock.
 *
 ****************************************************************************/
bool imxrt_clock_enableusbhs0clock(clock_usb_src_t src, uint32_t freq)
{
	CCM->CCGR6 |= CCM_CCGR6_CG0_MASK;
	#if defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
	USB->USBCMD |= USBHS_USBCMD_RST_MASK;
	#elif defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT105x)
	USB1->USBCMD |= USBHS_USBCMD_RST_MASK;
	#endif
	for (volatile uint32_t i = 0; i < 400000; i++) {/* Add a delay between RST and RS so make sure there is a DP pullup sequence*/
		__asm("nop");
	}
	PMU->REG_3P0 = (PMU->REG_3P0 & (~PMU_REG_3P0_OUTPUT_TRG_MASK)) |
				   (PMU_REG_3P0_OUTPUT_TRG(0x17) | PMU_REG_3P0_ENABLE_LINREG_MASK);
	return true;
}

#if !defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
/****************************************************************************
 * Function: imxrt_clock_enableusbhs1clock
 *
 * Description:
 *   brief Enable USB HS clock.
 *
 *   This function only enables the access to USB HS prepheral, upper layer
 *   should first call the ref CLOCK_EnableUsbhs0PhyPllClock to enable the PHY
 *   clock to use USB HS.
 *
 * Input Parameters:
 *   src  USB HS does not care about the clock source, here must be ref kCLOCK_UsbSrcUnused.
 *   freq USB HS does not care about the clock source, so this parameter is ignored.
 *
 * Returned Value:
 *   Returns true The clock is set successfully.
 *   Returns false The clock source is invalid to get proper USB HS clock.
 *
 ****************************************************************************/
bool imxrt_clock_enableusbhs1clock(clock_usb_src_t src, uint32_t freq)
{
	CCM->CCGR6 |= CCM_CCGR6_CG0_MASK;
	USB2->USBCMD |= USBHS_USBCMD_RST_MASK;
	for (volatile uint32_t i = 0; i < 400000; i++) { /* Add a delay between RST and RS so make sure there is a DP pullup sequence*/
		__asm("nop");
	}
	PMU->REG_3P0 = (PMU->REG_3P0 & (~PMU_REG_3P0_OUTPUT_TRG_MASK)) |
				   (PMU_REG_3P0_OUTPUT_TRG(0x17) | PMU_REG_3P0_ENABLE_LINREG_MASK);
	return true;
}
#endif

/****************************************************************************
 * Function: imxrt_clock_enableusbhs0phypllclock
 *
 * Description:
 *   brief Enable USB HS PHY PLL clock.
 *
 *   This function enables the internal 480MHz USB PHY PLL clock.
 *
 * Input Parameters:
 *   src  USB HS PHY PLL clock source.
 *   freq The frequency specified by src.
 *
 * Returned Value:
 *   Returns true The clock is set successfully.
 *   Returns false The clock source is invalid to get proper USB HS clock.
 *
 ****************************************************************************/
bool imxrt_clock_enableusbhs0phypllclock(clock_usb_phy_src_t src, uint32_t freq)
{
	const clock_usb_pll_config_t g_ccmConfigUsbPll = {.loopDivider = 0U};
	if (CCM_ANALOG->PLL_USB1 & CCM_ANALOG_PLL_USB1_ENABLE_MASK) {
		CCM_ANALOG->PLL_USB1 |= CCM_ANALOG_PLL_USB1_EN_USB_CLKS_MASK;
	} else {
		imxrt_clock_initusb1pll(&g_ccmConfigUsbPll);
	}

	#if defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
	USBPHY->CTRL &= ~USBPHY_CTRL_SFTRST_MASK; /* release PHY from reset */
	USBPHY->CTRL &= ~USBPHY_CTRL_CLKGATE_MASK;

