Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_clock.c
	USBPHY->PWD = 0;
	USBPHY->CTRL |= USBPHY_CTRL_ENAUTOCLR_PHY_PWD_MASK | USBPHY_CTRL_ENAUTOCLR_CLKGATE_MASK |
			USBPHY_CTRL_ENUTMILEVEL2_MASK | USBPHY_CTRL_ENUTMILEVEL3_MASK;
	#elif defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT105x)
	USBPHY1->CTRL &= ~USBPHY_CTRL_SFTRST_MASK; /* release PHY from reset */
	USBPHY1->CTRL &= ~USBPHY_CTRL_CLKGATE_MASK;

	USBPHY1->PWD = 0;
	USBPHY1->CTRL |= USBPHY_CTRL_ENAUTOCLR_PHY_PWD_MASK | USBPHY_CTRL_ENAUTOCLR_CLKGATE_MASK |
			 USBPHY_CTRL_ENUTMILEVEL2_MASK | USBPHY_CTRL_ENUTMILEVEL3_MASK;
	#endif
	return true;
}

/****************************************************************************
 * Function: imxrt_clock_disableusbhs0phypllclock
 *
 * Description:
 *   brief Disable USB HS PHY PLL clock.
 *
 *   This function disables USB HS PHY PLL clock.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_disableusbhs0phypllclock(void)
{
	CCM_ANALOG->PLL_USB1 &= ~CCM_ANALOG_PLL_USB1_EN_USB_CLKS_MASK;
	#if defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
	USBPHY->CTRL |= USBPHY_CTRL_CLKGATE_MASK; /* Set to 1U to gate clocks */
	#elif defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT105x)
	USBPHY1->CTRL |= USBPHY_CTRL_CLKGATE_MASK; /* Set to 1U to gate clocks */
	#endif
}

#if !defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
/****************************************************************************
 * Function: imxrt_clock_initarmpll
 *
 * Description:
 *   brief Initialize the ARM PLL.
 *
 *   This function initialize the ARM PLL with specific settings
 *
 * Input Parameters:
 *   config   configuration to set to PLL.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_initarmpll(const clock_arm_pll_config_t *config)
{
	/* Bypass PLL first */
	CCM_ANALOG->PLL_ARM = (CCM_ANALOG->PLL_ARM & (~CCM_ANALOG_PLL_ARM_BYPASS_CLK_SRC_MASK)) |
			       CCM_ANALOG_PLL_ARM_BYPASS_MASK | CCM_ANALOG_PLL_ARM_BYPASS_CLK_SRC(config->src);

	CCM_ANALOG->PLL_ARM =
		(CCM_ANALOG->PLL_ARM & (~(CCM_ANALOG_PLL_ARM_DIV_SELECT_MASK | CCM_ANALOG_PLL_ARM_POWERDOWN_MASK))) |
		CCM_ANALOG_PLL_ARM_ENABLE_MASK | CCM_ANALOG_PLL_ARM_DIV_SELECT(config->loopDivider);

	while ((CCM_ANALOG->PLL_ARM & CCM_ANALOG_PLL_ARM_LOCK_MASK) == 0) {
	}

	/* Disable Bypass */
	CCM_ANALOG->PLL_ARM &= ~CCM_ANALOG_PLL_ARM_BYPASS_MASK;
}

/****************************************************************************
 * Function: imxrt_clock_deinitarmpll
 *
 * Description:
 *   brief De-initialize the ARM PLL.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_deinitarmpll(void)
{
	CCM_ANALOG->PLL_ARM = CCM_ANALOG_PLL_ARM_POWERDOWN_MASK;
}
#endif

/****************************************************************************
 * Function: imxrt_clock_initsyspll
 *
 * Description:
 *   brief Initialize the System PLL.
 *
 *   This function initializes the System PLL with specific settings
 *
 * Input Parameters:
 *   config Configuration to set to PLL.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void imxrt_clock_initsyspll(const clock_sys_pll_config_t *config)
{
	/* Bypass PLL first */
	CCM_ANALOG->PLL_SYS = (CCM_ANALOG->PLL_SYS & (~CCM_ANALOG_PLL_SYS_BYPASS_CLK_SRC_MASK)) |
			       CCM_ANALOG_PLL_SYS_BYPASS_MASK | CCM_ANALOG_PLL_SYS_BYPASS_CLK_SRC(config->src);

	CCM_ANALOG->PLL_SYS =
		(CCM_ANALOG->PLL_SYS & (~(CCM_ANALOG_PLL_SYS_DIV_SELECT_MASK | CCM_ANALOG_PLL_SYS_POWERDOWN_MASK))) |
		CCM_ANALOG_PLL_SYS_ENABLE_MASK | CCM_ANALOG_PLL_SYS_DIV_SELECT(config->loopDivider);

	/* Initialize the fractional mode */
	CCM_ANALOG->PLL_SYS_NUM = CCM_ANALOG_PLL_SYS_NUM_A(config->numerator);
	CCM_ANALOG->PLL_SYS_DENOM = CCM_ANALOG_PLL_SYS_DENOM_B(config->denominator);

	/* Initialize the spread spectrum mode */
	CCM_ANALOG->PLL_SYS_SS = CCM_ANALOG_PLL_SYS_SS_STEP(config->ss_step) |
							 CCM_ANALOG_PLL_SYS_SS_ENABLE(config->ss_enable) |
							 CCM_ANALOG_PLL_SYS_SS_STOP(config->ss_stop);

	while ((CCM_ANALOG->PLL_SYS & CCM_ANALOG_PLL_SYS_LOCK_MASK) == 0) {
	}

	/* Disable Bypass */
	CCM_ANALOG->PLL_SYS &= ~CCM_ANALOG_PLL_SYS_BYPASS_MASK;
}

/****************************************************************************
 * Function: imxrt_clock_initsyspll
 *
 * Description:
 *   brief De-initialize the System PLL.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_deinitsyspll(void)
{
	CCM_ANALOG->PLL_SYS = CCM_ANALOG_PLL_SYS_POWERDOWN_MASK;
}

/****************************************************************************
 * Function: imxrt_clock_initusb1pll
 *
 * Description:
 *   brief Initialize the USB1 PLL.
 *
 *   This function initializes the USB1 PLL with specific settings
 *
 * Input Parameters:
 *   config Configuration to set to PLL.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_initusb1pll(const clock_usb_pll_config_t *config)
{
	/* Bypass PLL first */
	CCM_ANALOG->PLL_USB1 = (CCM_ANALOG->PLL_USB1 & (~CCM_ANALOG_PLL_USB1_BYPASS_CLK_SRC_MASK)) |
				CCM_ANALOG_PLL_USB1_BYPASS_MASK | CCM_ANALOG_PLL_USB1_BYPASS_CLK_SRC(config->src);

	CCM_ANALOG->PLL_USB1 = (CCM_ANALOG->PLL_USB1 & (~CCM_ANALOG_PLL_USB1_DIV_SELECT_MASK)) |
				CCM_ANALOG_PLL_USB1_ENABLE_MASK | CCM_ANALOG_PLL_USB1_POWER_MASK |
				CCM_ANALOG_PLL_USB1_EN_USB_CLKS_MASK | CCM_ANALOG_PLL_USB1_DIV_SELECT(config->loopDivider);

	while ((CCM_ANALOG->PLL_USB1 & CCM_ANALOG_PLL_USB1_LOCK_MASK) == 0) {
	}

	/* Disable Bypass */
	CCM_ANALOG->PLL_USB1 &= ~CCM_ANALOG_PLL_USB1_BYPASS_MASK;
}

/****************************************************************************
 * Function: imxrt_clock_initusb1pll
 *
 * Description:
 *   brief Deinitialize the USB1 PLL.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_deinitusb1pll(void)
{
	CCM_ANALOG->PLL_USB1 = 0U;
}

#if !defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
/****************************************************************************
 * Function: imxrt_clock_initusb2pll
 *
 * Description:
 *   brief Initialize the USB2 PLL.
 *
 *   This function initializes the USB2 PLL with specific settings
 *
 * Input Parameters:
 *   config Configuration to set to PLL.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void imxrt_clock_initusb2pll(const clock_usb_pll_config_t *config)
{
	/* Bypass PLL first */
	CCM_ANALOG->PLL_USB2 = (CCM_ANALOG->PLL_USB2 & (~CCM_ANALOG_PLL_USB2_BYPASS_CLK_SRC_MASK)) |
				CCM_ANALOG_PLL_USB2_BYPASS_MASK | CCM_ANALOG_PLL_USB2_BYPASS_CLK_SRC(config->src);

	CCM_ANALOG->PLL_USB2 = (CCM_ANALOG->PLL_USB2 & (~CCM_ANALOG_PLL_USB2_DIV_SELECT_MASK)) |
				CCM_ANALOG_PLL_USB2_ENABLE_MASK | CCM_ANALOG_PLL_USB2_POWER_MASK |
				CCM_ANALOG_PLL_USB2_EN_USB_CLKS_MASK | CCM_ANALOG_PLL_USB2_DIV_SELECT(config->loopDivider);

	while ((CCM_ANALOG->PLL_USB2 & CCM_ANALOG_PLL_USB2_LOCK_MASK) == 0) {
	}

	/* Disable Bypass */
	CCM_ANALOG->PLL_USB2 &= ~CCM_ANALOG_PLL_USB2_BYPASS_MASK;
}

/****************************************************************************
 * Function: imxrt_clock_deinitusb2pll
 *
 * Description:
 *   brief Deinitialize the USB2 PLL.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_deinitusb2pll(void)
{
	CCM_ANALOG->PLL_USB2 = 0U;
}
#endif

/****************************************************************************
 * Function: imxrt_clock_initaudiopll
 *
 * Description:
 *   brief Initializes the Audio PLL.
 *
 *   This function initializes the Audio PLL with specific settings
 *
 * Input Parameters:
 *   config Configuration to set to PLL.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

