Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_clock.c
void imxrt_clock_initaudiopll(const clock_audio_pll_config_t *config)
{
	uint32_t pllAudio;
	uint32_t misc2 = 0;

	/* Bypass PLL first */
	CCM_ANALOG->PLL_AUDIO = (CCM_ANALOG->PLL_AUDIO & (~CCM_ANALOG_PLL_AUDIO_BYPASS_CLK_SRC_MASK)) |
				 CCM_ANALOG_PLL_AUDIO_BYPASS_MASK | CCM_ANALOG_PLL_AUDIO_BYPASS_CLK_SRC(config->src);

	CCM_ANALOG->PLL_AUDIO_NUM = CCM_ANALOG_PLL_AUDIO_NUM_A(config->numerator);
	CCM_ANALOG->PLL_AUDIO_DENOM = CCM_ANALOG_PLL_AUDIO_DENOM_B(config->denominator);

	/*
	 * Set post divider:
	 *
	 * ------------------------------------------------------------------------
	 * | config->postDivider | PLL_AUDIO[POST_DIV_SELECT]  | MISC2[AUDIO_DIV] |
	 * ------------------------------------------------------------------------
	 * |         1           |            2                |        0         |
	 * ------------------------------------------------------------------------
	 * |         2           |            1                |        0         |
	 * ------------------------------------------------------------------------
	 * |         4           |            2                |        3         |
	 * ------------------------------------------------------------------------
	 * |         8           |            1                |        3         |
	 * ------------------------------------------------------------------------
	 * |         16          |            0                |        3         |
	 * ------------------------------------------------------------------------
	 */
	pllAudio =
		(CCM_ANALOG->PLL_AUDIO & (~(CCM_ANALOG_PLL_AUDIO_DIV_SELECT_MASK | CCM_ANALOG_PLL_AUDIO_POWERDOWN_MASK))) |
		CCM_ANALOG_PLL_AUDIO_ENABLE_MASK | CCM_ANALOG_PLL_AUDIO_DIV_SELECT(config->loopDivider);

	switch (config->postDivider) {
	case 16:
		pllAudio |= CCM_ANALOG_PLL_AUDIO_POST_DIV_SELECT(0);
		misc2 = CCM_ANALOG_MISC2_AUDIO_DIV_MSB_MASK | CCM_ANALOG_MISC2_AUDIO_DIV_LSB_MASK;
		break;
	case 8:
		pllAudio |= CCM_ANALOG_PLL_AUDIO_POST_DIV_SELECT(1);
		misc2 = CCM_ANALOG_MISC2_AUDIO_DIV_MSB_MASK | CCM_ANALOG_MISC2_AUDIO_DIV_LSB_MASK;
		break;
	case 4:
		pllAudio |= CCM_ANALOG_PLL_AUDIO_POST_DIV_SELECT(2);
		misc2 = CCM_ANALOG_MISC2_AUDIO_DIV_MSB_MASK | CCM_ANALOG_MISC2_AUDIO_DIV_LSB_MASK;
		break;
	case 2:
		pllAudio |= CCM_ANALOG_PLL_AUDIO_POST_DIV_SELECT(1);
		break;
	default:
		pllAudio |= CCM_ANALOG_PLL_AUDIO_POST_DIV_SELECT(2);
		break;
	}

	CCM_ANALOG->MISC2 =
		(CCM_ANALOG->MISC2 & ~(CCM_ANALOG_MISC2_AUDIO_DIV_LSB_MASK | CCM_ANALOG_MISC2_AUDIO_DIV_MSB_MASK)) | misc2;

	CCM_ANALOG->PLL_AUDIO = pllAudio;

	while ((CCM_ANALOG->PLL_AUDIO & CCM_ANALOG_PLL_AUDIO_LOCK_MASK) == 0) {
	}

	/* Disable Bypass */
	CCM_ANALOG->PLL_AUDIO &= ~CCM_ANALOG_PLL_AUDIO_BYPASS_MASK;
}

/****************************************************************************
 * Function: imxrt_clock_deinitaudiopll
 *
 * Description:
 *   brief De-initialize the Audio PLL.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_deinitaudiopll(void)
{
	CCM_ANALOG->PLL_AUDIO = CCM_ANALOG_PLL_AUDIO_POWERDOWN_MASK;
}

#if !defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
/****************************************************************************
 * Function: imxrt_clock_initvideopll
 *
 * Description:
 *   brief Initialize the video PLL.
 *
 *   This function configures the Video PLL with specific settings
 *
 * Input Parameters:
 *   config   configuration to set to PLL.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void imxrt_clock_initvideopll(const clock_video_pll_config_t *config)
{
	uint32_t pllVideo;
	uint32_t misc2 = 0;

	/* Bypass PLL first */
	CCM_ANALOG->PLL_VIDEO = (CCM_ANALOG->PLL_VIDEO & (~CCM_ANALOG_PLL_VIDEO_BYPASS_CLK_SRC_MASK)) |
				 CCM_ANALOG_PLL_VIDEO_BYPASS_MASK | CCM_ANALOG_PLL_VIDEO_BYPASS_CLK_SRC(config->src);

	CCM_ANALOG->PLL_VIDEO_NUM = CCM_ANALOG_PLL_VIDEO_NUM_A(config->numerator);
	CCM_ANALOG->PLL_VIDEO_DENOM = CCM_ANALOG_PLL_VIDEO_DENOM_B(config->denominator);

	/*
	 * Set post divider:
	 *
	 * ------------------------------------------------------------------------
	 * | config->postDivider | PLL_VIDEO[POST_DIV_SELECT]  | MISC2[VIDEO_DIV] |
	 * ------------------------------------------------------------------------
	 * |         1           |            2                |        0         |
	 * ------------------------------------------------------------------------
	 * |         2           |            1                |        0         |
	 * ------------------------------------------------------------------------
	 * |         4           |            2                |        3         |
	 * ------------------------------------------------------------------------
	 * |         8           |            1                |        3         |
	 * ------------------------------------------------------------------------
	 * |         16          |            0                |        3         |
	 * ------------------------------------------------------------------------
	 */
	pllVideo =
		(CCM_ANALOG->PLL_VIDEO & (~(CCM_ANALOG_PLL_VIDEO_DIV_SELECT_MASK | CCM_ANALOG_PLL_VIDEO_POWERDOWN_MASK))) |
		CCM_ANALOG_PLL_VIDEO_ENABLE_MASK | CCM_ANALOG_PLL_VIDEO_DIV_SELECT(config->loopDivider);

	switch (config->postDivider) {
	case 16:
		pllVideo |= CCM_ANALOG_PLL_VIDEO_POST_DIV_SELECT(0);
		misc2 = CCM_ANALOG_MISC2_VIDEO_DIV(3);
		break;
	case 8:
		pllVideo |= CCM_ANALOG_PLL_VIDEO_POST_DIV_SELECT(1);
		misc2 = CCM_ANALOG_MISC2_VIDEO_DIV(3);
		break;
	case 4:
		pllVideo |= CCM_ANALOG_PLL_VIDEO_POST_DIV_SELECT(2);
		misc2 = CCM_ANALOG_MISC2_VIDEO_DIV(3);
		break;
	case 2:
		pllVideo |= CCM_ANALOG_PLL_VIDEO_POST_DIV_SELECT(1);
		break;
	default:
		pllVideo |= CCM_ANALOG_PLL_VIDEO_POST_DIV_SELECT(2);
		break;
	}

	CCM_ANALOG->MISC2 = (CCM_ANALOG->MISC2 & ~CCM_ANALOG_MISC2_VIDEO_DIV_MASK) | misc2;

	CCM_ANALOG->PLL_VIDEO = pllVideo;

	while ((CCM_ANALOG->PLL_VIDEO & CCM_ANALOG_PLL_VIDEO_LOCK_MASK) == 0) {
	}

	/* Disable Bypass */
	CCM_ANALOG->PLL_VIDEO &= ~CCM_ANALOG_PLL_VIDEO_BYPASS_MASK;
}

/****************************************************************************
 * Function: imxrt_clock_deinitvideopll
 *
 * Description:
 *   brief De-initialize the Video PLL.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_deinitvideopll(void)
{
	CCM_ANALOG->PLL_VIDEO = CCM_ANALOG_PLL_VIDEO_POWERDOWN_MASK;
}
#endif

/****************************************************************************
 * Function: imxrt_clock_initenetpll
 *
 * Description:
 *   brief Initialize the ENET PLL.
 *
 *   This function initializes the ENET PLL with specific settings.
 *
 * Input Parameters:
 *   config Configuration to set to PLL.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void imxrt_clock_initenetpll(const clock_enet_pll_config_t *config)
{
	uint32_t enet_pll = CCM_ANALOG_PLL_ENET_DIV_SELECT(config->loopDivider);

	CCM_ANALOG->PLL_ENET = (CCM_ANALOG->PLL_ENET & (~CCM_ANALOG_PLL_ENET_BYPASS_CLK_SRC_MASK)) |
				CCM_ANALOG_PLL_ENET_BYPASS_MASK | CCM_ANALOG_PLL_ENET_BYPASS_CLK_SRC(config->src);

