Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_clock.c
	if (config->enableClkOutput) {
		enet_pll |= CCM_ANALOG_PLL_ENET_ENABLE_MASK;
	}

	if (config->enableClkOutput25M) {
		enet_pll |= CCM_ANALOG_PLL_ENET_ENET_25M_REF_EN_MASK;
	}

	#if defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
	if (config->enableClkOutput500M)
	{
		enet_pll |= CCM_ANALOG_PLL_ENET_ENET_500M_REF_EN_MASK;
	}
	#endif

	CCM_ANALOG->PLL_ENET =
		(CCM_ANALOG->PLL_ENET & (~(CCM_ANALOG_PLL_ENET_DIV_SELECT_MASK | CCM_ANALOG_PLL_ENET_POWERDOWN_MASK))) |
		enet_pll;

	/* Wait for stable */
	while ((CCM_ANALOG->PLL_ENET & CCM_ANALOG_PLL_ENET_LOCK_MASK) == 0) {
	}

	/* Disable Bypass */
	CCM_ANALOG->PLL_ENET &= ~CCM_ANALOG_PLL_ENET_BYPASS_MASK;
}

/****************************************************************************
 * Function: imxrt_clock_deinitenetpll
 *
 * Description:
 *   brief Deinitialize the ENET PLL.
 * 
 *   This function disables the ENET PLL.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_deinitenetpll(void)
{
	CCM_ANALOG->PLL_ENET = CCM_ANALOG_PLL_ENET_POWERDOWN_MASK;
}

/****************************************************************************
 * Function: imxrt_clock_getpllfreq
 *
 * Description:
 *   brief Get current PLL output frequency.
 *
 *   This function get current output frequency of specific PLL
 *
 * Input Parameters:
 *   pll   pll name to get frequency.
 *
 * Returned Value:
 *   Returns The PLL output frequency in hertz.
 *
 ****************************************************************************/
uint32_t imxrt_clock_getpllfreq(clock_pll_t pll)
{
	uint32_t freq;
	uint32_t divSelect;
	clock_64b_t freqTmp;

	const uint32_t enetRefClkFreq[] = {
		25000000U,  /* 25M */
		50000000U,  /* 50M */
		100000000U, /* 100M */
		125000000U  /* 125M */
	};

	/* check if PLL is enabled */
	if (!imxrt_clock_ispllenabled(CCM_ANALOG, pll)) {
		return 0U;
	}

	/* get pll reference clock */
	freq = imxrt_clock_getpllbypassrefclk(CCM_ANALOG, pll);

	/* check if pll is bypassed */
	if (imxrt_clock_ispllbypassed(CCM_ANALOG, pll)) {
		return freq;
	}

	switch (pll) {
	#if !defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
	case kCLOCK_PllArm:
		freq = ((freq * ((CCM_ANALOG->PLL_ARM & CCM_ANALOG_PLL_ARM_DIV_SELECT_MASK) >>
				CCM_ANALOG_PLL_ARM_DIV_SELECT_SHIFT)) >>
				1U);
		break;
	#endif
	case kCLOCK_PllSys:
		/* PLL output frequency = Fref * (DIV_SELECT + NUM/DENOM). */
		freqTmp = ((clock_64b_t)freq * ((clock_64b_t)(CCM_ANALOG->PLL_SYS_NUM))) /
			  ((clock_64b_t)(CCM_ANALOG->PLL_SYS_DENOM));

		if (CCM_ANALOG->PLL_SYS & CCM_ANALOG_PLL_SYS_DIV_SELECT_MASK) {
			freq *= 22U;
		} else {
			freq *= 20U;
		}

		freq += (uint32_t)freqTmp;
		break;
	case kCLOCK_PllUsb1:
		freq = (freq * ((CCM_ANALOG->PLL_USB1 & CCM_ANALOG_PLL_USB1_DIV_SELECT_MASK) ? 22U : 20U));
		break;
	case kCLOCK_PllAudio:
		/* PLL output frequency = Fref * (DIV_SELECT + NUM/DENOM). */
		divSelect =
			(CCM_ANALOG->PLL_AUDIO & CCM_ANALOG_PLL_AUDIO_DIV_SELECT_MASK) >> CCM_ANALOG_PLL_AUDIO_DIV_SELECT_SHIFT;

		freqTmp = ((clock_64b_t)freq * ((clock_64b_t)(CCM_ANALOG->PLL_AUDIO_NUM))) /
					((clock_64b_t)(CCM_ANALOG->PLL_AUDIO_DENOM));

		freq = freq * divSelect + (uint32_t)freqTmp;

		/* AUDIO PLL output = PLL output frequency / POSTDIV. */

		/*
		 * Post divider:
		 *
		 * PLL_AUDIO[POST_DIV_SELECT]:
		 * 0x00: 4
		 * 0x01: 2
		 * 0x02: 1
		 *
		 * MISC2[AUDO_DIV]:
		 * 0x00: 1
		 * 0x01: 2
		 * 0x02: 1
		 * 0x03: 4
		 */
		switch (CCM_ANALOG->PLL_AUDIO & CCM_ANALOG_PLL_AUDIO_POST_DIV_SELECT_MASK) {
		case CCM_ANALOG_PLL_AUDIO_POST_DIV_SELECT(0U):
			freq = freq >> 2U;
			break;
		case CCM_ANALOG_PLL_AUDIO_POST_DIV_SELECT(1U):
			freq = freq >> 1U;
			break;
		default:
			break;
		}

		switch (CCM_ANALOG->MISC2 & (CCM_ANALOG_MISC2_AUDIO_DIV_MSB_MASK | CCM_ANALOG_MISC2_AUDIO_DIV_LSB_MASK)) {
		case CCM_ANALOG_MISC2_AUDIO_DIV_MSB(1) | CCM_ANALOG_MISC2_AUDIO_DIV_LSB(1):
			freq >>= 2U;
			break;
		case CCM_ANALOG_MISC2_AUDIO_DIV_MSB(0) | CCM_ANALOG_MISC2_AUDIO_DIV_LSB(1):
			freq >>= 1U;
			break;
		default:
			break;
		}
		break;

	#if !defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
	case kCLOCK_PllVideo:
		/* PLL output frequency = Fref * (DIV_SELECT + NUM/DENOM). */
		divSelect =
			(CCM_ANALOG->PLL_VIDEO & CCM_ANALOG_PLL_VIDEO_DIV_SELECT_MASK) >> CCM_ANALOG_PLL_VIDEO_DIV_SELECT_SHIFT;

		freqTmp = ((clock_64b_t)freq * ((clock_64b_t)(CCM_ANALOG->PLL_VIDEO_NUM))) /
					((clock_64b_t)(CCM_ANALOG->PLL_VIDEO_DENOM));

		freq = freq * divSelect + (uint32_t)freqTmp;

		/* VIDEO PLL output = PLL output frequency / POSTDIV. */

		/*
		 * Post divider:
		 *
		 * PLL_VIDEO[POST_DIV_SELECT]:
		 * 0x00: 4
		 * 0x01: 2
		 * 0x02: 1
		 *
		 * MISC2[VIDEO_DIV]:
		 * 0x00: 1
		 * 0x01: 2
		 * 0x02: 1
		 * 0x03: 4
		 */
		switch (CCM_ANALOG->PLL_VIDEO & CCM_ANALOG_PLL_VIDEO_POST_DIV_SELECT_MASK) {
		case CCM_ANALOG_PLL_VIDEO_POST_DIV_SELECT(0U):
			freq = freq >> 2U;
			break;
		case CCM_ANALOG_PLL_VIDEO_POST_DIV_SELECT(1U):
			freq = freq >> 1U;
			break;
		default:
			break;
		}

		switch (CCM_ANALOG->MISC2 & CCM_ANALOG_MISC2_VIDEO_DIV_MASK) {
		case CCM_ANALOG_MISC2_VIDEO_DIV(3):
			freq >>= 2U;
			break;
		case CCM_ANALOG_MISC2_VIDEO_DIV(1):
			freq >>= 1U;
			break;
		default:
			break;
		}
		break;
	#endif
	case kCLOCK_PllEnet:
		divSelect =
			(CCM_ANALOG->PLL_ENET & CCM_ANALOG_PLL_ENET_DIV_SELECT_MASK) >> CCM_ANALOG_PLL_ENET_DIV_SELECT_SHIFT;
		freq = enetRefClkFreq[divSelect];
		break;
	case kCLOCK_PllEnet25M:
		/* ref_enetpll1 if fixed at 25MHz. */
		freq = 25000000UL;
		break;
	#if !defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
	case kCLOCK_PllUsb2:
		freq = (freq * ((CCM_ANALOG->PLL_USB2 & CCM_ANALOG_PLL_USB2_DIV_SELECT_MASK) ? 22U : 20U));
		break;
	#endif
	default:
		freq = 0U;
		break;
	}

	return freq;
}

/****************************************************************************
 * Function: imxrt_clock_initsyspfd
 *
 * Description:
 *   brief Initialize the System PLL PFD.
 *
 *   This function initializes the System PLL PFD. During new value setting,
 *   the clock output is disabled to prevent glitch.
 *
 * Input Parameters:
 *   pfd Which PFD clock to enable.
 *   pfdFrac The PFD FRAC value.
 *   note It is recommended that PFD settings are kept between 12-35.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_initsyspfd(clock_pfd_t pfd, uint8_t pfdFrac)
{
	uint32_t pfdIndex = (uint32_t)pfd;
	uint32_t pfd528;

