Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_clock.c
	pfd528 = CCM_ANALOG->PFD_528 &
			 ~((CCM_ANALOG_PFD_528_PFD0_CLKGATE_MASK | CCM_ANALOG_PFD_528_PFD0_FRAC_MASK) << (8 * pfdIndex));

	/* Disable the clock output first. */
	CCM_ANALOG->PFD_528 = pfd528 | (CCM_ANALOG_PFD_528_PFD0_CLKGATE_MASK << (8 * pfdIndex));

	/* Set the new value and enable output. */
	CCM_ANALOG->PFD_528 = pfd528 | (CCM_ANALOG_PFD_528_PFD0_FRAC(pfdFrac) << (8 * pfdIndex));
}

/****************************************************************************
 * Function: imxrt_clock_deinitsyspfd
 *
 * Description:
 *   brief De-initialize the System PLL PFD.
 *
 *   This function disables the System PLL PFD.
 *
 * Input Parameters:
 *   pfd Which PFD clock to disable.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_deinitsyspfd(clock_pfd_t pfd)
{
	CCM_ANALOG->PFD_528 |= CCM_ANALOG_PFD_528_PFD0_CLKGATE_MASK << (8 * pfd);
}

/****************************************************************************
 * Function: imxrt_clock_initusb1pfd
 *
 * Description:
 *   brief Initialize the USB1 PLL PFD.
 *
 *   This function initializes the USB1 PLL PFD. During new value setting,
 *   the clock output is disabled to prevent glitch.
 *
 * Input Parameters:
 *   pfd Which PFD clock to enable.
 *   pfdFrac The PFD FRAC value.
 *   note It is recommended that PFD settings are kept between 12-35.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_initusb1pfd(clock_pfd_t pfd, uint8_t pfdFrac)
{
	uint32_t pfdIndex = (uint32_t)pfd;
	uint32_t pfd480;

	pfd480 = CCM_ANALOG->PFD_480 &
			 ~((CCM_ANALOG_PFD_480_PFD0_CLKGATE_MASK | CCM_ANALOG_PFD_480_PFD0_FRAC_MASK) << (8 * pfdIndex));

	/* Disable the clock output first. */
	CCM_ANALOG->PFD_480 = pfd480 | (CCM_ANALOG_PFD_480_PFD0_CLKGATE_MASK << (8 * pfdIndex));

	/* Set the new value and enable output. */
	CCM_ANALOG->PFD_480 = pfd480 | (CCM_ANALOG_PFD_480_PFD0_FRAC(pfdFrac) << (8 * pfdIndex));
}

/****************************************************************************
 * Function: imxrt_clock_deinitusb1pfd
 *
 * Description:
 *   brief De-initialize the USB1 PLL PFD.
 *
 *   This function disables the USB1 PLL PFD.
 *
 * Input Parameters:
 *   pfd Which PFD clock to disable.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_deinitusb1pfd(clock_pfd_t pfd)
{
	CCM_ANALOG->PFD_480 |= CCM_ANALOG_PFD_480_PFD0_CLKGATE_MASK << (8 * pfd);
}

/****************************************************************************
 * Function: imxrt_clock_deinitusb1pfd
 *
 * Description:
 *   brief Get current System PLL PFD output frequency.
 *
 *   This function get current output frequency of specific System PLL PFD
 *
 * Input Parameters:
 *   pfd   pfd name to get frequency.
 *
 * Returned Value:
 *   Returns The PFD output frequency in hertz.
 *
 ****************************************************************************/
uint32_t imxrt_clock_getsyspfdfreq(clock_pfd_t pfd)
{
	uint32_t freq = imxrt_clock_getpllfreq(kCLOCK_PllSys);

	switch (pfd) {
	case kCLOCK_Pfd0:
		freq /= ((CCM_ANALOG->PFD_528 & CCM_ANALOG_PFD_528_PFD0_FRAC_MASK) >> CCM_ANALOG_PFD_528_PFD0_FRAC_SHIFT);
		break;
	case kCLOCK_Pfd1:
		freq /= ((CCM_ANALOG->PFD_528 & CCM_ANALOG_PFD_528_PFD1_FRAC_MASK) >> CCM_ANALOG_PFD_528_PFD1_FRAC_SHIFT);
		break;
	case kCLOCK_Pfd2:
		freq /= ((CCM_ANALOG->PFD_528 & CCM_ANALOG_PFD_528_PFD2_FRAC_MASK) >> CCM_ANALOG_PFD_528_PFD2_FRAC_SHIFT);
		break;
	case kCLOCK_Pfd3:
		freq /= ((CCM_ANALOG->PFD_528 & CCM_ANALOG_PFD_528_PFD3_FRAC_MASK) >> CCM_ANALOG_PFD_528_PFD3_FRAC_SHIFT);
		break;
	default:
		freq = 0U;
		break;
	}
	freq *= 18U;

	return freq;
}

/****************************************************************************
 * Function: imxrt_clock_getusb1pfdfreq
 *
 * Description:
 *   brief Get current USB1 PLL PFD output frequency.
 *
 *   This function get current output frequency of specific USB1 PLL PFD
 *
 * Input Parameters:
 *   pfd   pfd name to get frequency.
 *
 * Returned Value:
 *   Returns The PFD output frequency in hertz.
 *
 ****************************************************************************/
uint32_t imxrt_clock_getusb1pfdfreq(clock_pfd_t pfd)
{
	uint32_t freq = imxrt_clock_getpllfreq(kCLOCK_PllUsb1);

	switch (pfd) {
	case kCLOCK_Pfd0:
		freq /= ((CCM_ANALOG->PFD_480 & CCM_ANALOG_PFD_480_PFD0_FRAC_MASK) >> CCM_ANALOG_PFD_480_PFD0_FRAC_SHIFT);
		break;
	case kCLOCK_Pfd1:
		freq /= ((CCM_ANALOG->PFD_480 & CCM_ANALOG_PFD_480_PFD1_FRAC_MASK) >> CCM_ANALOG_PFD_480_PFD1_FRAC_SHIFT);
		break;
	case kCLOCK_Pfd2:
		freq /= ((CCM_ANALOG->PFD_480 & CCM_ANALOG_PFD_480_PFD2_FRAC_MASK) >> CCM_ANALOG_PFD_480_PFD2_FRAC_SHIFT);
		break;
	case kCLOCK_Pfd3:
		freq /= ((CCM_ANALOG->PFD_480 & CCM_ANALOG_PFD_480_PFD3_FRAC_MASK) >> CCM_ANALOG_PFD_480_PFD3_FRAC_SHIFT);
		break;
	default:
		freq = 0U;
		break;
	}
	freq *= 18U;

	return freq;
}

#if !defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
/****************************************************************************
 * Function: imxrt_clock_enableusbhs1phypllclock
 *
 * Description:
 *   brief Enable USB HS PHY PLL clock.
 *
 *   This function enables the internal 480MHz USB PHY PLL clock.
 *
 * Input Parameters:
 *   src  USB HS PHY PLL clock source.
 *   freq The frequency specified by src.
 *
 * Returned Value:
 *   Returns true The clock is set successfully.
 *   Returns false The clock source is invalid to get proper USB HS clock.
 *
 ****************************************************************************/

bool imxrt_clock_enableusbhs1phypllclock(clock_usb_phy_src_t src, uint32_t freq)
{
	const clock_usb_pll_config_t g_ccmConfigUsbPll = {.loopDivider = 0U};
	imxrt_clock_initusb2pll(&g_ccmConfigUsbPll);
	USBPHY2->CTRL &= ~USBPHY_CTRL_SFTRST_MASK; /* release PHY from reset */
	USBPHY2->CTRL &= ~USBPHY_CTRL_CLKGATE_MASK;

	USBPHY2->PWD = 0;
	USBPHY2->CTRL |= USBPHY_CTRL_ENAUTOCLR_PHY_PWD_MASK | USBPHY_CTRL_ENAUTOCLR_CLKGATE_MASK |
			 USBPHY_CTRL_ENUTMILEVEL2_MASK | USBPHY_CTRL_ENUTMILEVEL3_MASK;

	return true;
}

/****************************************************************************
 * Function: imxrt_clock_disableusbhs1phypllclock
 *
 * Description:
 *   brief Disable USB HS PHY PLL clock.
 *
 *   This function disables USB HS PHY PLL clock.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_clock_disableusbhs1phypllclock(void)
{
	CCM_ANALOG->PLL_USB2 &= ~CCM_ANALOG_PLL_USB2_EN_USB_CLKS_MASK;
	USBPHY2->CTRL |= USBPHY_CTRL_CLKGATE_MASK; /* Set to 1U to gate clocks */
}
#endif
